{
  "backend/main.mo": "Minimal Motoko actor with no logic implemented.",
  "feature_evidence.json": "Report listing feature implementations, involved files, components, and test IDs for system verification.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of all frontend source files and their roles.",
  "frontend/index.css": "Tailwind-based global stylesheet defining theme variables and component styling for light and dark modes.",
  "frontend/index.html": "Static HTML entry point loading fonts, icons, and mounting the React application.",
  "frontend/src/App.tsx": "Root React component managing authentication, sidebar navigation, and conditional rendering of inventory and billing views.",
  "frontend/src/components/auth/PasswordLogin.tsx": "Password-only login screen with input handling, validation errors, and loading state.",
  "frontend/src/components/erp/BillingView.tsx": "Billing interface with product search, cart management, and bill finalization features.",
  "frontend/src/components/erp/InventoryView.tsx": "Inventory management UI for adding items, updating stock, searching, and deleting entries.",
  "frontend/src/components/erp/MainHeader.tsx": "Header displaying current view title, sales metrics, and an optional logout button.",
  "frontend/src/components/erp/SalesHistory.tsx": "Displays a sales table with time, summary, total, and a delete button for each sale.",
  "frontend/src/components/erp/Sidebar.tsx": "Renders the ERP sidebar with profile image upload, live clock, navigation, and asset value display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, status tracking, and persisted identity loading.",
  "frontend/src/hooks/useInventory.ts": "Manages inventory items with loading, saving, search filtering, stock updates, and asset value calculation.",
  "frontend/src/hooks/useLiveClock.ts": "Provides live-updating time and date values via an interval.",
  "frontend/src/hooks/usePasswordGate.ts": "Implements a simple password gate using sessionStorage with login/logout and session checking.",
  "frontend/src/hooks/useSales.ts": "Handles loading, saving, adding, deleting, and summarizing sales records with computed totals.",
  "frontend/src/index.css": "Defines global UI theme and styles, including layout, login screen, sidebar, tables, and components.",
  "frontend/src/lib/dateUtils.ts": "Utility functions returning formatted current date and time strings.",
  "frontend/src/lib/enterKeyShift.ts": "Handles Enter key to move focus or trigger submission for sequential input navigation.",
  "frontend/src/lib/erpPersistenceContract.ts": "Validates localStorage key contracts during development to prevent breaking persisted data.",
  "frontend/src/lib/inventoryStorage.ts": "Loads and saves inventory data from localStorage.",
  "frontend/src/lib/localStorageKeys.ts": "Defines constant localStorage keys for inventory, sales, and profile image.",
  "frontend/src/lib/profileImage.ts": "Loads and saves the profile image URL to localStorage with a default fallback.",
  "frontend/src/lib/salesStorage.ts": "Loads and saves sales data from localStorage.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/types/erp.ts": "Defines TypeScript types for views, inventory items, cart items, and sale records.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, including goals, architecture notes, and a list of implemented features for the SPA ERP interface."
}